## Pandas 
#### https://pandas.pydata.org/docs/user_guide/10min.html

### 10 minutes to pandas

In [2]:
import numpy as np

import pandas as pd

In [3]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
## periods means how many dates u want 
dates = pd.date_range("20130401",periods=5)
dates

DatetimeIndex(['2013-04-01', '2013-04-02', '2013-04-03', '2013-04-04',
               '2013-04-05'],
              dtype='datetime64[ns]', freq='D')

In [5]:
dates = pd.date_range("20130401",periods=6)
dates

DatetimeIndex(['2013-04-01', '2013-04-02', '2013-04-03', '2013-04-04',
               '2013-04-05', '2013-04-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-04-01  0.777903 -1.415671 -0.308915 -1.571088
2013-04-02  1.328935 -0.170983  2.100717  0.435475
2013-04-03 -0.822457 -0.975014  1.481187  1.005982
2013-04-04  0.017298 -0.153512  0.141858  0.507474
2013-04-05  1.789567 -0.061937  0.135591  0.184802
2013-04-06 -1.418394 -1.070894  0.988784  1.636099

### Creating a DataFrame by passing a dictionary of objects that can be converted into a series-like structure:

In [7]:
df2 = pd.DataFrame(
    {
        "A": [0,11,9,3],
        "B": pd.Timestamp("20230405"),
        "C": pd.Series(2, index=list(range(4)), dtype="float32"),
        "D": np.array([5] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)
df2

    A          B    C  D      E    F
0   0 2023-04-05  2.0  5   test  foo
1  11 2023-04-05  2.0  5  train  foo
2   9 2023-04-05  2.0  5   test  foo
3   3 2023-04-05  2.0  5  train  foo

### Viewing data

In [8]:
df.head()

                   A         B         C         D
2013-04-01  0.777903 -1.415671 -0.308915 -1.571088
2013-04-02  1.328935 -0.170983  2.100717  0.435475
2013-04-03 -0.822457 -0.975014  1.481187  1.005982
2013-04-04  0.017298 -0.153512  0.141858  0.507474
2013-04-05  1.789567 -0.061937  0.135591  0.184802

In [9]:
df.tail()

                   A         B         C         D
2013-04-02  1.328935 -0.170983  2.100717  0.435475
2013-04-03 -0.822457 -0.975014  1.481187  1.005982
2013-04-04  0.017298 -0.153512  0.141858  0.507474
2013-04-05  1.789567 -0.061937  0.135591  0.184802
2013-04-06 -1.418394 -1.070894  0.988784  1.636099

### Display the DataFrame.index

In [10]:
df.index

DatetimeIndex(['2013-04-01', '2013-04-02', '2013-04-03', '2013-04-04',
               '2013-04-05', '2013-04-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

### DataFrame.columns:

In [12]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [13]:
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

### DataFrame.to_numpy()

In [14]:
df

                   A         B         C         D
2013-04-01  0.777903 -1.415671 -0.308915 -1.571088
2013-04-02  1.328935 -0.170983  2.100717  0.435475
2013-04-03 -0.822457 -0.975014  1.481187  1.005982
2013-04-04  0.017298 -0.153512  0.141858  0.507474
2013-04-05  1.789567 -0.061937  0.135591  0.184802
2013-04-06 -1.418394 -1.070894  0.988784  1.636099

In [15]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [16]:
# DataFrame.to_numpy() does not include the index or column labels in the output.
df.to_numpy()

array([[ 0.77790265, -1.41567113, -0.30891495, -1.57108792],
       [ 1.32893498, -0.170983  ,  2.10071696,  0.4354754 ],
       [-0.82245661, -0.97501357,  1.48118653,  1.00598197],
       [ 0.01729834, -0.15351238,  0.14185832,  0.50747372],
       [ 1.78956738, -0.06193685,  0.13559139,  0.18480179],
       [-1.41839419, -1.07089431,  0.98878438,  1.63609883]])

In [17]:
# DataFrame.to_numpy() does not include the index or column labels in the output.
df2.to_numpy()

array([[0, Timestamp('2023-04-05 00:00:00'), 2.0, 5, 'test', 'foo'],
       [11, Timestamp('2023-04-05 00:00:00'), 2.0, 5, 'train', 'foo'],
       [9, Timestamp('2023-04-05 00:00:00'), 2.0, 5, 'test', 'foo'],
       [3, Timestamp('2023-04-05 00:00:00'), 2.0, 5, 'train', 'foo']],
      dtype=object)

## describe() shows a quick statistic summary of your data:

In [18]:
## describe() shows a quick statistic summary of your data:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.278809 -0.641335  0.756537  0.366457
std    1.248673  0.581440  0.925685  1.080066
min   -1.418394 -1.415671 -0.308915 -1.571088
25%   -0.612518 -1.046924  0.137158  0.247470
50%    0.397600 -0.572998  0.565321  0.471475
75%    1.191177 -0.157880  1.358086  0.881355
max    1.789567 -0.061937  2.100717  1.636099

### Transposing your data:

In [19]:
df.T

   2013-04-01  2013-04-02  2013-04-03  2013-04-04  2013-04-05  2013-04-06
A    0.777903    1.328935   -0.822457    0.017298    1.789567   -1.418394
B   -1.415671   -0.170983   -0.975014   -0.153512   -0.061937   -1.070894
C   -0.308915    2.100717    1.481187    0.141858    0.135591    0.988784
D   -1.571088    0.435475    1.005982    0.507474    0.184802    1.636099

In [20]:
df2.T

,0,1,2,3
A,0,11,9,3
B,2023-04-05 00:00:00,2023-04-05 00:00:00,2023-04-05 00:00:00,2023-04-05 00:00:00
C,2.0,2.0,2.0,2.0
D,5,5,5,5
E,test,train,test,train
F,foo,foo,foo,foo

### DataFrame.sort_index() sorts by an axis:

In [21]:
df

                   A         B         C         D
2013-04-01  0.777903 -1.415671 -0.308915 -1.571088
2013-04-02  1.328935 -0.170983  2.100717  0.435475
2013-04-03 -0.822457 -0.975014  1.481187  1.005982
2013-04-04  0.017298 -0.153512  0.141858  0.507474
2013-04-05  1.789567 -0.061937  0.135591  0.184802
2013-04-06 -1.418394 -1.070894  0.988784  1.636099

In [22]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-04-01 -1.571088 -0.308915 -1.415671  0.777903
2013-04-02  0.435475  2.100717 -0.170983  1.328935
2013-04-03  1.005982  1.481187 -0.975014 -0.822457
2013-04-04  0.507474  0.141858 -0.153512  0.017298
2013-04-05  0.184802  0.135591 -0.061937  1.789567
2013-04-06  1.636099  0.988784 -1.070894 -1.418394

In [23]:
df2

    A          B    C  D      E    F
0   0 2023-04-05  2.0  5   test  foo
1  11 2023-04-05  2.0  5  train  foo
2   9 2023-04-05  2.0  5   test  foo
3   3 2023-04-05  2.0  5  train  foo

In [24]:
df2.sort_index(axis=1, ascending=False)

     F      E  D    C          B   A
0  foo   test  5  2.0 2023-04-05   0
1  foo  train  5  2.0 2023-04-05  11
2  foo   test  5  2.0 2023-04-05   9
3  foo  train  5  2.0 2023-04-05   3

### Getting Selecting a single column, which yields a Series, equivalent to df.A:

In [25]:
df["A"]

2013-04-01    0.777903
2013-04-02    1.328935
2013-04-03   -0.822457
2013-04-04    0.017298
2013-04-05    1.789567
2013-04-06   -1.418394
Freq: D, Name: A, dtype: float64

In [26]:
df2["A"]

0     0
1    11
2     9
3     3
Name: A, dtype: int64

In [27]:
df2["B"]

0   2023-04-05
1   2023-04-05
2   2023-04-05
3   2023-04-05
Name: B, dtype: datetime64[ns]

### which slices the rows:

In [28]:
df[0:3]

                   A         B         C         D
2013-04-01  0.777903 -1.415671 -0.308915 -1.571088
2013-04-02  1.328935 -0.170983  2.100717  0.435475
2013-04-03 -0.822457 -0.975014  1.481187  1.005982

In [29]:
df2[2:5]

   A          B    C  D      E    F
2  9 2023-04-05  2.0  5   test  foo
3  3 2023-04-05  2.0  5  train  foo

In [39]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02  0.383588 -2.749397 -0.755886  0.078656
2013-01-03 -0.071138 -0.022407 -0.915144 -0.966005
2013-01-04  0.733736  1.047441 -1.915406  0.615553

### Selection by label

In [30]:
df.loc[dates[0]]

A    0.777903
B   -1.415671
C   -0.308915
D   -1.571088
Name: 2013-04-01 00:00:00, dtype: float64

In [40]:
df

                   A         B         C         D
2013-01-01 -1.542797  0.514622  1.873114 -0.303630
2013-01-02  0.383588 -2.749397 -0.755886  0.078656
2013-01-03 -0.071138 -0.022407 -0.915144 -0.966005
2013-01-04  0.733736  1.047441 -1.915406  0.615553
2013-01-05 -0.025860 -1.262533  0.905396 -0.770388
2013-01-06 -0.067680 -0.379514  0.774456  0.426713

In [41]:
### All Rows but only two column A and B
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01 -1.542797  0.514622
2013-01-02  0.383588 -2.749397
2013-01-03 -0.071138 -0.022407
2013-01-04  0.733736  1.047441
2013-01-05 -0.025860 -1.262533
2013-01-06 -0.067680 -0.379514

In [32]:
dates = pd.date_range("20130101", periods=6)
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))

In [33]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02  0.383588 -2.749397
2013-01-03 -0.071138 -0.022407
2013-01-04  0.733736  1.047441

In [42]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02  0.383588 -2.749397
2013-01-03 -0.071138 -0.022407
2013-01-04  0.733736  1.047441

In [43]:
df.loc[dates[0], "A"]

-1.5427968734225974

In [34]:
df

                   A         B         C         D
2013-01-01 -1.542797  0.514622  1.873114 -0.303630
2013-01-02  0.383588 -2.749397 -0.755886  0.078656
2013-01-03 -0.071138 -0.022407 -0.915144 -0.966005
2013-01-04  0.733736  1.047441 -1.915406  0.615553
2013-01-05 -0.025860 -1.262533  0.905396 -0.770388
2013-01-06 -0.067680 -0.379514  0.774456  0.426713

In [35]:
df.iloc[3]

A    0.733736
B    1.047441
C   -1.915406
D    0.615553
Name: 2013-01-04 00:00:00, dtype: float64

In [36]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.733736  1.047441
2013-01-05 -0.025860 -1.262533

In [38]:
df.iloc[3:]

                   A         B         C         D
2013-01-04  0.733736  1.047441 -1.915406  0.615553
2013-01-05 -0.025860 -1.262533  0.905396 -0.770388
2013-01-06 -0.067680 -0.379514  0.774456  0.426713

In [48]:
df

                   A         B         C         D
2013-01-01 -1.542797  0.514622  1.873114 -0.303630
2013-01-02  0.383588 -2.749397 -0.755886  0.078656
2013-01-03 -0.071138 -0.022407 -0.915144 -0.966005
2013-01-04  0.733736  1.047441 -1.915406  0.615553
2013-01-05 -0.025860 -1.262533  0.905396 -0.770388
2013-01-06 -0.067680 -0.379514  0.774456  0.426713

In [58]:
### The code df.iloc[[0, 1, 4], [0, 2]] selects rows 0, 1, and 4, 
# as well as columns 0 and 2, from a pandas DataFrame df.
df.iloc[[0, 1, 4], [0, 2]]

                   A         C
2013-01-01 -1.542797  1.873114
2013-01-02  0.383588 -0.755886
2013-01-05 -0.025860  0.905396

In [59]:
df.iloc[[0, 1, 5], [0, 2]]

                   A         C
2013-01-01 -1.542797  1.873114
2013-01-02  0.383588 -0.755886
2013-01-06 -0.067680  0.774456

In [60]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.383588 -2.749397 -0.755886  0.078656
2013-01-03 -0.071138 -0.022407 -0.915144 -0.966005

In [62]:
##  df.iloc[:, 1:3] selects all rows and columns 1 and 2 
# from a pandas DataFrame 
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.514622  1.873114
2013-01-02 -2.749397 -0.755886
2013-01-03 -0.022407 -0.915144
2013-01-04  1.047441 -1.915406
2013-01-05 -1.262533  0.905396
2013-01-06 -0.379514  0.774456

### selects the element at row index 1 and column index 1 from a pandas DataFrame df.

In [63]:
df.iat[1, 1]

-2.7493967431015944

In [64]:
df.iat[0, 1]

0.5146223449947015

### Boolean indexing

In [65]:
###  df[df["A"] > 0] selects all rows from a pandas DataFrame df where 
# the values in column "A" are greater than 0.
df[df["A"] > 0]

                   A         B         C         D
2013-01-02  0.383588 -2.749397 -0.755886  0.078656
2013-01-04  0.733736  1.047441 -1.915406  0.615553

In [67]:
### The code df[df > 0] selects all elements from a pandas DataFrame df that are greater than 0,
# and replaces the other elements with NaN.
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  0.514622  1.873114       NaN
2013-01-02  0.383588       NaN       NaN  0.078656
2013-01-03       NaN       NaN       NaN       NaN
2013-01-04  0.733736  1.047441       NaN  0.615553
2013-01-05       NaN       NaN  0.905396       NaN
2013-01-06       NaN       NaN  0.774456  0.426713

In [69]:
df2 = df.copy()
df2

                   A         B         C         D
2013-01-01 -1.542797  0.514622  1.873114 -0.303630
2013-01-02  0.383588 -2.749397 -0.755886  0.078656
2013-01-03 -0.071138 -0.022407 -0.915144 -0.966005
2013-01-04  0.733736  1.047441 -1.915406  0.615553
2013-01-05 -0.025860 -1.262533  0.905396 -0.770388
2013-01-06 -0.067680 -0.379514  0.774456  0.426713

In [71]:
df2["E"] = ["one", "one", "two", "three", "four", "three"]
df2

                   A         B         C         D      E
2013-01-01 -1.542797  0.514622  1.873114 -0.303630    one
2013-01-02  0.383588 -2.749397 -0.755886  0.078656    one
2013-01-03 -0.071138 -0.022407 -0.915144 -0.966005    two
2013-01-04  0.733736  1.047441 -1.915406  0.615553  three
2013-01-05 -0.025860 -1.262533  0.905396 -0.770388   four
2013-01-06 -0.067680 -0.379514  0.774456  0.426713  three

In [72]:
### df2[df2["E"].isin(["two", "four"])] selects all rows from a pandas DataFrame df2 where the values in column "E" match any 
# of the values in the list ["two", "four"].
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2013-01-03 -0.071138 -0.022407 -0.915144 -0.966005   two
2013-01-05 -0.025860 -1.262533  0.905396 -0.770388  four

In [73]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))

s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [74]:
df

                   A         B         C         D
2013-01-01 -1.542797  0.514622  1.873114 -0.303630
2013-01-02  0.383588 -2.749397 -0.755886  0.078656
2013-01-03 -0.071138 -0.022407 -0.915144 -0.966005
2013-01-04  0.733736  1.047441 -1.915406  0.615553
2013-01-05 -0.025860 -1.262533  0.905396 -0.770388
2013-01-06 -0.067680 -0.379514  0.774456  0.426713

In [78]:
df.at[dates[0], "A"] = 0
df.at[dates[0], "B"] = 0
df.at[dates[0], "C"] = 0
df.at[dates[0], "D"] = 0
df

                   A         B         C         D
2013-01-01  0.000000  0.000000  0.000000  0.000000
2013-01-02  0.383588 -2.749397 -0.755886  0.078656
2013-01-03 -0.071138 -0.022407 -0.915144 -0.966005
2013-01-04  0.733736  1.047441 -1.915406  0.615553
2013-01-05 -0.025860 -1.262533  0.905396 -0.770388
2013-01-06 -0.067680 -0.379514  0.774456  0.426713

In [79]:
df

                   A         B         C         D
2013-01-01  0.000000  0.000000  0.000000  0.000000
2013-01-02  0.383588 -2.749397 -0.755886  0.078656
2013-01-03 -0.071138 -0.022407 -0.915144 -0.966005
2013-01-04  0.733736  1.047441 -1.915406  0.615553
2013-01-05 -0.025860 -1.262533  0.905396 -0.770388
2013-01-06 -0.067680 -0.379514  0.774456  0.426713

In [89]:
df.iat[2, 2] = 0 ###sets the value at row index 1 and column index 1 of a pandas DataFrame df to 0.

df

                   A         B         C         D
2013-01-01  0.000000  0.000000  0.000000  0.000000
2013-01-02  0.383588  0.000000 -0.755886  0.078656
2013-01-03 -0.071138  0.000000  0.000000  0.000000
2013-01-04  0.733736  1.047441 -1.915406  0.000000
2013-01-05 -0.025860 -1.262533  0.905396 -0.770388
2013-01-06 -0.067680 -0.379514  0.774456  0.426713

In [93]:
df.loc[:, "D"] = np.array([2] * len(df))
df

                   A         B         C  D
2013-01-01  0.000000  0.000000  0.000000  2
2013-01-02  0.383588  0.000000 -0.755886  2
2013-01-03 -0.071138  0.000000  0.000000  2
2013-01-04  0.733736  1.047441 -1.915406  2
2013-01-05 -0.025860 -1.262533  0.905396  2
2013-01-06 -0.067680 -0.379514  0.774456  2

In [95]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D
2013-01-01  0.000000  0.000000  0.000000 -2
2013-01-02 -0.383588  0.000000 -0.755886 -2
2013-01-03 -0.071138  0.000000  0.000000 -2
2013-01-04 -0.733736 -1.047441 -1.915406 -2
2013-01-05 -0.025860 -1.262533 -0.905396 -2
2013-01-06 -0.067680 -0.379514 -0.774456 -2

In [96]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])
df1

                   A         B         C  D   E
2013-01-01  0.000000  0.000000  0.000000  2 NaN
2013-01-02  0.383588  0.000000 -0.755886  2 NaN
2013-01-03 -0.071138  0.000000  0.000000  2 NaN
2013-01-04  0.733736  1.047441 -1.915406  2 NaN

In [97]:
df1.loc[dates[0] : dates[1], "E"] = 1
df1

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  0.000000  2  1.0
2013-01-02  0.383588  0.000000 -0.755886  2  1.0
2013-01-03 -0.071138  0.000000  0.000000  2  NaN
2013-01-04  0.733736  1.047441 -1.915406  2  NaN

In [98]:
df1

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  0.000000  2  1.0
2013-01-02  0.383588  0.000000 -0.755886  2  1.0
2013-01-03 -0.071138  0.000000  0.000000  2  NaN
2013-01-04  0.733736  1.047441 -1.915406  2  NaN

In [99]:
df1.dropna(how="any")

                   A    B         C  D    E
2013-01-01  0.000000  0.0  0.000000  2  1.0
2013-01-02  0.383588  0.0 -0.755886  2  1.0

### Operations

In [100]:
### The method df.mean() returns the mean 
# value for each column of a pandas DataFrame 
df.mean()

A    0.158774
B   -0.099101
C   -0.165240
D    2.000000
dtype: float64

In [102]:
### df, while df.mean(1) 
# returns the mean value for each row.
df.mean(1)

2013-01-01    0.500000
2013-01-02    0.406926
2013-01-03    0.482216
2013-01-04    0.466443
2013-01-05    0.404251
2013-01-06    0.581816
Freq: D, dtype: float64

In [106]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [109]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [108]:
df

                   A         B         C  D
2013-01-01  0.000000  0.000000  0.000000  2
2013-01-02  0.383588  0.000000 -0.755886  2
2013-01-03 -0.071138  0.000000  0.000000  2
2013-01-04  0.733736  1.047441 -1.915406  2
2013-01-05 -0.025860 -1.262533  0.905396  2
2013-01-06 -0.067680 -0.379514  0.774456  2

In [107]:
df.sub(s, axis="index")

                   A         B         C    D
2013-01-01       NaN       NaN       NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN
2013-01-03 -1.071138 -1.000000 -1.000000  1.0
2013-01-04 -2.266264 -1.952559 -4.915406 -1.0
2013-01-05 -5.025860 -6.262533 -4.094604 -3.0
2013-01-06       NaN       NaN       NaN  NaN

### Apply

In [110]:
df.apply(np.cumsum)

                   A         B         C   D
2013-01-01  0.000000  0.000000  0.000000   2
2013-01-02  0.383588  0.000000 -0.755886   4
2013-01-03  0.312451  0.000000 -0.755886   6
2013-01-04  1.046186  1.047441 -2.671292   8
2013-01-05  1.020326 -0.215091 -1.765896  10
2013-01-06  0.952646 -0.594605 -0.991440  12